In [40]:
import pandas  as pd
import numpy as np

In [4]:
print(pd)

<module 'pandas' from 'C:\\Users\\sjuga\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\pandas\\__init__.py'>

In [90]:
#dict1 convert to Pd

dict1={
    "name":["jugal" , "sharma" , "karan" , "anku"],
    "marks":[92 , 40 , 20 , 68],
    "city":["jammu" , "rampur" , "pinkcity" , "newYokr"]
} 

#print(dict1["name"])
df=pd.DataFrame(dict1)
print(df)
#use a list of indexes:
print(df.loc[[0, 1]])
#convet to csv file
#df.to_csv("friend.csv")
#ff.dtypes
#df.columns
#df.rows
#df.to_csv("friend.csv" , index=False)

     name  marks      city
0   jugal     92     jammu
1  sharma     40    rampur
2   karan     20  pinkcity
3    anku     68   newYokr
     name  marks    city
0   jugal     92   jammu
1  sharma     40  rampur

In [65]:
#check csv file

new.info()
df.head(2)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 0 to 19
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       20 non-null     float64
 1   1       20 non-null     float64
 2   2       20 non-null     float64
 3   3       20 non-null     float64
 4   4       20 non-null     float64
 5   5       20 non-null     float64
 6   6       20 non-null     float64
 7   7       20 non-null     float64
 8   8       20 non-null     float64
 9   9       20 non-null     float64
dtypes: float64(10)
memory usage: 1.7 KB

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479

     name  marks      city
0   jugal     92     jammu
1  sharma     40    rampur
2   karan     20  pinkcity
3    anku     68   newYokr

In [26]:
df.describe()

           marks
count   4.000000
mean   55.000000
std    31.559468
min    20.000000
25%    35.000000
50%    54.000000
75%    74.000000
max    92.000000

In [36]:
#read csv file

js=pd.read_csv("Shett.csv")
js.head(5)
#df.tail(4)
#js["Price"]
#df.describe()
#skiprow

#ff=pd.read_csv("Shett.csv"  , skiprows=[1 ,2,3])

#ff

       Price       Open       High        Low   data
0  56,506.10  43,824.40  57,814.00  43,292.90  10.21
1  43,823.30  47,129.20  52,885.00  39,646.80   9.21
2  47,130.40  41,510.00  50,498.00  37,365.40   8.21
3  41,553.70  35,030.70  42,285.00  29,310.20   7.21
4  35,026.90  37,294.30  41,318.00  28,901.80   6.21

In [53]:

#create a reandom 
ser=pd.Series(np.random.rand(20))

ser
type(ser)

RangeIndex(start=0, stop=10, step=1)

In [61]:
new=pd.DataFrame(np.random.rand(20 , 10), index=np.arange(20))
type(new)
new.index#check index 
#new.columns
new.to_numpy()#convert to numpy
new.head(5)
#new.sort_index(axis=0 , ascending=False)

,0,1,2,3,4,5,6,7,8,9
0,0.787183,0.187942,0.225597,0.291697,0.605915,0.128058,0.693708,0.947974,0.934327,0.742297
1,0.897311,0.032107,0.841087,0.848751,0.216092,0.761246,0.399394,0.938489,0.456527,0.455294
2,0.980539,0.889570,0.664287,0.605134,0.307077,0.749329,0.232388,0.941439,0.582911,0.998478
3,0.922324,0.964001,0.941907,0.715552,0.107769,0.244323,0.716357,0.406750,0.827759,0.011034
4,0.598018,0.056534,0.132210,0.791035,0.055560,0.316640,0.633688,0.586564,0.233656,0.670097